# Soal 1
S=12. Ketika S>18, maka cetak 12,13,14,15 dan 'selesai

In [11]:
s = 12

while s<=19:
    if s<=15:
        print(s)
    elif s>18:
        print('selesai',s)
    s+=1

12
13
14
15
selesai 19

# Soal 2
dari list 
- sistem = ["saya","pergi","ke","LPPI","kemang"]
- engineer = ["tidak","jalan","karena","banjir"]

tampilkan:\
&nbsp;&nbsp;&nbsp;&nbsp; saya\
&nbsp;&nbsp;&nbsp;&nbsp; tidak\
&nbsp;&nbsp;&nbsp;&nbsp; pergi\
&nbsp;&nbsp;&nbsp;&nbsp; karena banjir
    
⁠tampilkan:\
&nbsp;&nbsp;&nbsp;&nbsp; saya\
&nbsp;&nbsp;&nbsp;&nbsp; tetap\
&nbsp;&nbsp;&nbsp;&nbsp; pergi\
&nbsp;&nbsp;&nbsp;&nbsp; karena banjir

In [6]:
sistem = ["saya","pergi","ke","LPPI","kemang"]
engineer = ["tidak","jalan","karena","banjir"]

print(sistem[0], "\n", engineer[0], "\n",
      sistem[1], "\n", engineer[-2], engineer[-1])

saya
 tidak
 pergi
 karena banjir

In [7]:
engineer[0] = "tetap"
print(sistem[0], "\n", engineer[0], "\n",
      sistem[1], "\n", engineer[-2], engineer[-1])

saya
 tetap
 pergi
 karena banjir

# Soal 3
 berdasarkan tabel nilai yg ada di excel, tampilkan jika nilai A <= 60 atau nilai B <=60, maka dinyatakan gagal

In [8]:
nama = ['nama1','nama2','nama3','nama4','nama5']
nilaiA = [80,55,80,75,90]
nilaiB = [70,70,90,60,70]

for i in range(len(nama)):
    if (nilaiA[i]<=60) or nilaiB[i]<=60:
        print(f"{nama[i]}, nilaiA= {nilaiA[i]}, nilaiA= {nilaiB[i]}, total= {nilaiA[i]+nilaiB[i]}, status: tidak lulus")
    else:
        print(f"{nama[i]}, nilaiA= {nilaiA[i]}, nilaiA= {nilaiB[i]}, total= {nilaiA[i]+nilaiB[i]}, status: lulus")

nama1, nilaiA= 80, nilaiA= 70, total= 150, status: lulus
nama2, nilaiA= 55, nilaiA= 70, total= 125, status: tidak lulus
nama3, nilaiA= 80, nilaiA= 90, total= 170, status: lulus
nama4, nilaiA= 75, nilaiA= 60, total= 135, status: tidak lulus
nama5, nilaiA= 90, nilaiA= 70, total= 160, status: lulus

# Soal 4
⁠buat inputan nama, nilai UTS, nilai UAS, terus bandingkan nilainya. jika nilai uts <=60 atau nilai uas<=60 atau nilai total(uts+uas)<=125 tampilkan gagal/tidak lulus. selain itu tampilkan lulus

In [9]:
nama = input('nama: ')
uts = int(input('nilai UTS: '))
uas = int(input('nilai UAS: '))

print(f"\n\nnama\t: {nama} \nuts\t: {uts} \nuas\t: {uas} \ntotal\t: {uts+uas}")

if uts <= 60 or uas <= 60 or (uts+uas)<=125:
    print('Maaf anda Gagal')
else :
    print('Selamat anda Lulus')

nama: imroatus
nilai UTS: 80
nilai UAS: 60


nama	: imroatus
uts	: 80
uas	: 60
total	: 140
Maaf anda Gagal

# Soal 5
konversi huruf dari kata BaT, masing2 huruf konversi ke biner, oktal, desimal dan heksadesimal

In [10]:
kata = input('masukkan kata: ')
#kata = 'BaT'
#huruf = [str(huruf) for huruf in kata]

print('kata\t= ', kata)
#print('huruf= ', huruf)


for i in range(len(kata)):
    print('\nhuruf\t= ', kata[i])
    desimal1 = ord(kata[i])
    print('desimal\t= ', desimal1)
    
    biner = ''
    oktal = ''
    hexa = ''

    #biner
    desimal=desimal1
    while desimal > 0:
        sisa = desimal % 2
        biner = str(sisa) + biner
        desimal //= 2
    print('biner\t= ', biner)

    #oktal
    desimal=desimal1
    while desimal > 0:
        sisa = desimal % 8
        oktal = str(sisa) + oktal
        desimal //= 8
    print('oktal\t= ', oktal)

    #hexa
    desimal=desimal1
    hex_chars = "0123456789ABCDEF"
    while desimal > 0:
         sisa = desimal % 16
         hexa = hex_chars[sisa] + hexa
         desimal //= 16
    print('hexa\t= ', hexa)

masukkan kata: BaT
kata	=  BaT

huruf	=  B
desimal	=  66
biner	=  1000010
oktal	=  102
hexa	=  42

huruf	=  a
desimal	=  97
biner	=  1100001
oktal	=  141
hexa	=  61

huruf	=  T
desimal	=  84
biner	=  1010100
oktal	=  124
hexa	=  54

# Day 5

In [13]:
f = open('hi.txt')

In [14]:
#harus beda line dengan close
print(f.readlines())

['yyy']

In [15]:
f.close()

### adding new line in script

In [23]:
f = open('hi.txt', 'a') #a append, w write (menimpa yg sebelumnya)
f.write(' hii, how r u?')
f.close()

In [25]:
f = open('hi.txt')
f.readlines()

['yyy hii, how r u?']

### menimpa file sebelumnya

In [94]:
f = open('hi.txt', 'w') #w write (menimpa yg sebelumnya)
f.write('Pelatihan kita di LPPI Kemang dengan waktu yang telah ditentukan')
f.close()

In [95]:
f = open('hi.txt')
f.readlines()

['Pelatihan kita di LPPI Kemang dengan waktu yang telah ditentukan']

### adding text

In [87]:
import re
def modify(filepath, from_):
    with open('hi.txt') as f:
        lines = [line.rstrip('\n') for line in f]
    lines = lines[0].split()
    awal = lines[:from_]
    akhir = lines[from_:]
    
    f = open('hi.txt', 'w') #w write (menimpa yg sebelumnya)
    f.write(' '.join([str(elem) for elem in awal]) + ' dari pagi sampai sore ' 
            + ' '.join([str(elem) for elem in akhir]))
    f.close()

In [88]:
modify('hi.txt', 5)

In [89]:
f = open('hi.txt')
f.readlines()

['Pelatihan kita di LPPI Kemang dari pagi sampai sore dengan waktu yang telah ditentukan']

### soal

In [170]:
def perhitungan(kata):
    with open('readme.txt', 'x') as f:
        f.write(f'hasil perhitungan desimal, oktal, biner, dan hexa dari huruf {kata} adalah \n')
    #f = open('hasil.txt', x)
    result = ''
    for i in range(len(kata)):
        desimal1 = ord(kata[i])
        biner = ''
        oktal = ''
        hexa = ''

        #biner
        desimal=desimal1
        while desimal > 0:
            sisa = desimal % 2
            biner = str(sisa) + biner
            desimal //= 2

        #oktal
        desimal=desimal1
        while desimal > 0:
            sisa = desimal % 8
            oktal = str(sisa) + oktal
            desimal //= 8
        

        #hexa
        desimal=desimal1
        hex_chars = "0123456789ABCDEF"
        while desimal > 0:
             sisa = desimal % 16
             hexa = hex_chars[sisa] + hexa
             desimal //= 16
        
        result = f"{kata[i]} = {desimal1}, {biner}, {oktal}, {hexa} \n"
        
        f = open('readme.txt', 'a')
        f.write(result)
        f.close()

In [171]:
perhitungan('kkyyy')

In [137]:
len('kk')

2

In [173]:
nama = input('Nama: ')
ruang = input('Ruang: ')
skema = input('Skema: ')
perhitungan(nama)

Nama: imroatus
Ruang: 1
Skema: 1

# SQL

In [176]:
pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-8.3.0-cp310-cp310-macosx_13_0_arm64.whl (15.3 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 15.3/15.3 MB 897.6 kB/s eta 0:00:0000:0100:01
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.3.0
Note: you may need to restart the kernel to use updated packages.

In [178]:
import mysql.connector

In [252]:
mydb = mysql.connector.connect(host="localhost",
                               user="root", 
                               password="", 
                               database="sakila"
)
mycursor = mydb.cursor()

In [182]:
mycursor.execute("select * from actor;")
myresult = mycursor.fetchall()
print(myresult)

[(1, 'PENELOPE', 'GUINESS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (2, 'NICK', 'WAHLBERG', datetime.datetime(2006, 2, 15, 4, 34, 33)), (3, 'ED', 'CHASE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (4, 'JENNIFER', 'DAVIS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (5, 'JOHNNY', 'LOLLOBRIGIDA', datetime.datetime(2006, 2, 15, 4, 34, 33)), (6, 'BETTE', 'NICHOLSON', datetime.datetime(2006, 2, 15, 4, 34, 33)), (7, 'GRACE', 'MOSTEL', datetime.datetime(2006, 2, 15, 4, 34, 33)), (8, 'MATTHEW', 'JOHANSSON', datetime.datetime(2006, 2, 15, 4, 34, 33)), (9, 'JOE', 'SWANK', datetime.datetime(2006, 2, 15, 4, 34, 33)), (10, 'CHRISTIAN', 'GABLE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (11, 'ZERO', 'CAGE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (12, 'KARL', 'BERRY', datetime.datetime(2006, 2, 15, 4, 34, 33)), (13, 'UMA', 'WOOD', datetime.datetime(2006, 2, 15, 4, 34, 33)), (14, 'VIVIEN', 'BERGEN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (15, 'CUBA', 'OLIVIER', datetime.datetime(2006, 2, 15, 4, 34, 33)), (16, 'FRED', 'COSTNER', datetime.datetime(2006, 2, 15, 4, 34, 33)), (17, 'HELEN', 'VOIGHT', datetime.datetime(2006, 2, 15, 4, 34, 33)), (18, 'DAN', 'TORN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (19, 'BOB', 'FAWCETT', datetime.datetime(2006, 2, 15, 4, 34, 33)), (20, 'LUCILLE', 'TRACY', datetime.datetime(2006, 2, 15, 4, 34, 33)), (21, 'KIRSTEN', 'PALTROW', datetime.datetime(2006, 2, 15, 4, 34, 33)), (22, 'ELVIS', 'MARX', datetime.datetime(2006, 2, 15, 4, 34, 33)), (23, 'SANDRA', 'KILMER', datetime.datetime(2006, 2, 15, 4, 34, 33)), (24, 'CAMERON', 'STREEP', datetime.datetime(2006, 2, 15, 4, 34, 33)), (25, 'KEVIN', 'BLOOM', datetime.datetime(2006, 2, 15, 4, 34, 33)), (26, 'RIP', 'CRAWFORD', datetime.datetime(2006, 2, 15, 4, 34, 33)), (27, 'JULIA', 'MCQUEEN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (28, 'WOODY', 'HOFFMAN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (29, 'ALEC', 'WAYNE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (30, 'SANDRA', 'PECK', datetime.datetime(2006, 2, 15, 4, 34, 33)), (31, 'SISSY', 'SOBIESKI', datetime.datetime(2006, 2, 15, 4, 34, 33)), (32, 'TIM', 'HACKMAN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (33, 'MILLA', 'PECK', datetime.datetime(2006, 2, 15, 4, 34, 33)), (34, 'AUDREY', 'OLIVIER', datetime.datetime(2006, 2, 15, 4, 34, 33)), (35, 'JUDY', 'DEAN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (36, 'BURT', 'DUKAKIS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (37, 'VAL', 'BOLGER', datetime.datetime(2006, 2, 15, 4, 34, 33)), (38, 'TOM', 'MCKELLEN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (39, 'GOLDIE', 'BRODY', datetime.datetime(2006, 2, 15, 4, 34, 33)), (40, 'JOHNNY', 'CAGE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (41, 'JODIE', 'DEGENERES', datetime.datetime(2006, 2, 15, 4, 34, 33)), (42, 'TOM', 'MIRANDA', datetime.datetime(2006, 2, 15, 4, 34, 33)), (43, 'KIRK', 'JOVOVICH', datetime.datetime(2006, 2, 15, 4, 34, 33)), (44, 'NICK', 'STALLONE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (45, 'REESE', 'KILMER', datetime.datetime(2006, 2, 15, 4, 34, 33)), (46, 'PARKER', 'GOLDBERG', datetime.datetime(2006, 2, 15, 4, 34, 33)), (47, 'JULIA', 'BARRYMORE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (48, 'FRANCES', 'DAY-LEWIS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (49, 'ANNE', 'CRONYN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (50, 'NATALIE', 'HOPKINS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (51, 'GARY', 'PHOENIX', datetime.datetime(2006, 2, 15, 4, 34, 33)), (52, 'CARMEN', 'HUNT', datetime.datetime(2006, 2, 15, 4, 34, 33)), (53, 'MENA', 'TEMPLE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (54, 'PENELOPE', 'PINKETT', datetime.datetime(2006, 2, 15, 4, 34, 33)), (55, 'FAY', 'KILMER', datetime.datetime(2006, 2, 15, 4, 34, 33)), (56, 'DAN', 'HARRIS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (57, 'JUDE', 'CRUISE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (58, 'CHRISTIAN', 'AKROYD', datetime.datetime(2006, 2, 15, 4, 34, 33)), (59, 'DUSTIN', 'TAUTOU', datetime.datetime(2006, 2, 15, 4, 34, 33)), (60, 'HENRY', 'BERRY', datetime.datetime(2006, 2, 15, 4, 34, 33)), (61, 'CHRISTIAN', 'NEESON', datetime.datetime(2006, 2, 15, 4, 34, 33)), (62, 'JAYNE', 'NEESON', datetime.datetime(2006, 2, 15, 4, 34, 33)), (63, 'CAMERON', 'WRAY', datetime.datetime(2006, 2, 15, 4, 34, 33)), (64, 'RAY', 'JOHANSSON', datetime.datetime(2006, 2, 15, 4, 34, 33)), (65, 'ANGELA', 'HUDSON', datetime.datetime(2006, 2, 15, 4, 34, 33)), (66, 'MARY', 'TANDY', datetime.datetime(2006, 2, 15, 4, 34, 33)), (67, 'JESSICA', 'BAILEY', datetime.datetime(2006, 2, 15, 4, 34, 33)), (68, 'RIP', 'WINSLET', datetime.datetime(2006, 2, 15, 4, 34, 33)), (69, 'KENNETH', 'PALTROW', datetime.datetime(2006, 2, 15, 4, 34, 33)), (70, 'MICHELLE', 'MCCONAUGHEY', datetime.datetime(2006, 2, 15, 4, 34, 33)), (71, 'ADAM', 'GRANT', datetime.datetime(2006, 2, 15, 4, 34, 33)), (72, 'SEAN', 'WILLIAMS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (73, 'GARY', 'PENN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (74, 'MILLA', 'KEITEL', datetime.datetime(2006, 2, 15, 4, 34, 33)), (75, 'BURT', 'POSEY', datetime.datetime(2006, 2, 15, 4, 34, 33)), (76, 'ANGELINA', 'ASTAIRE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (77, 'CARY', 'MCCONAUGHEY', datetime.datetime(2006, 2, 15, 4, 34, 33)), (78, 'GROUCHO', 'SINATRA', datetime.datetime(2006, 2, 15, 4, 34, 33)), (79, 'MAE', 'HOFFMAN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (80, 'RALPH', 'CRUZ', datetime.datetime(2006, 2, 15, 4, 34, 33)), (81, 'SCARLETT', 'DAMON', datetime.datetime(2006, 2, 15, 4, 34, 33)), (82, 'WOODY', 'JOLIE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (83, 'BEN', 'WILLIS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (84, 'JAMES', 'PITT', datetime.datetime(2006, 2, 15, 4, 34, 33)), (85, 'MINNIE', 'ZELLWEGER', datetime.datetime(2006, 2, 15, 4, 34, 33)), (86, 'GREG', 'CHAPLIN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (87, 'SPENCER', 'PECK', datetime.datetime(2006, 2, 15, 4, 34, 33)), (88, 'KENNETH', 'PESCI', datetime.datetime(2006, 2, 15, 4, 34, 33)), (89, 'CHARLIZE', 'DENCH', datetime.datetime(2006, 2, 15, 4, 34, 33)), (90, 'SEAN', 'GUINESS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (91, 'CHRISTOPHER', 'BERRY', datetime.datetime(2006, 2, 15, 4, 34, 33)), (92, 'KIRSTEN', 'AKROYD', datetime.datetime(2006, 2, 15, 4, 34, 33)), (93, 'ELLEN', 'PRESLEY', datetime.datetime(2006, 2, 15, 4, 34, 33)), (94, 'KENNETH', 'TORN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (95, 'DARYL', 'WAHLBERG', datetime.datetime(2006, 2, 15, 4, 34, 33)), (96, 'GENE', 'WILLIS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (97, 'MEG', 'HAWKE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (98, 'CHRIS', 'BRIDGES', datetime.datetime(2006, 2, 15, 4, 34, 33)), (99, 'JIM', 'MOSTEL', datetime.datetime(2006, 2, 15, 4, 34, 33)), (100, 'SPENCER', 'DEPP', datetime.datetime(2006, 2, 15, 4, 34, 33)), (101, 'SUSAN', 'DAVIS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (102, 'WALTER', 'TORN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (103, 'MATTHEW', 'LEIGH', datetime.datetime(2006, 2, 15, 4, 34, 33)), (104, 'PENELOPE', 'CRONYN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (105, 'SIDNEY', 'CROWE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (106, 'GROUCHO', 'DUNST', datetime.datetime(2006, 2, 15, 4, 34, 33)), (107, 'GINA', 'DEGENERES', datetime.datetime(2006, 2, 15, 4, 34, 33)), (108, 'WARREN', 'NOLTE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (109, 'SYLVESTER', 'DERN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (110, 'SUSAN', 'DAVIS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (111, 'CAMERON', 'ZELLWEGER', datetime.datetime(2006, 2, 15, 4, 34, 33)), (112, 'RUSSELL', 'BACALL', datetime.datetime(2006, 2, 15, 4, 34, 33)), (113, 'MORGAN', 'HOPKINS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (114, 'MORGAN', 'MCDORMAND', datetime.datetime(2006, 2, 15, 4, 34, 33)), (115, 'HARRISON', 'BALE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (116, 'DAN', 'STREEP', datetime.datetime(2006, 2, 15, 4, 34, 33)), (117, 'RENEE', 'TRACY', datetime.datetime(2006, 2, 15, 4, 34, 33)), (118, 'CUBA', 'ALLEN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (119, 'WARREN', 'JACKMAN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (120, 'PENELOPE', 'MONROE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (121, 'LIZA', 'BERGMAN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (122, 'SALMA', 'NOLTE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (123, 'JULIANNE', 'DENCH', datetime.datetime(2006, 2, 15, 4, 34, 33)), (124, 'SCARLETT', 'BENING', datetime.datetime(2006, 2, 15, 4, 34, 33)), (125, 'ALBERT', 'NOLTE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (126, 'FRANCES', 'TOMEI', datetime.datetime(2006, 2, 15, 4, 34, 33)), (127, 'KEVIN', 'GARLAND', datetime.datetime(2006, 2, 15, 4, 34, 33)), (128, 'CATE', 'MCQUEEN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (129, 'DARYL', 'CRAWFORD', datetime.datetime(2006, 2, 15, 4, 34, 33)), (130, 'GRETA', 'KEITEL', datetime.datetime(2006, 2, 15, 4, 34, 33)), (131, 'JANE', 'JACKMAN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (132, 'ADAM', 'HOPPER', datetime.datetime(2006, 2, 15, 4, 34, 33)), (133, 'RICHARD', 'PENN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (134, 'GENE', 'HOPKINS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (135, 'RITA', 'REYNOLDS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (136, 'ED', 'MANSFIELD', datetime.datetime(2006, 2, 15, 4, 34, 33)), (137, 'MORGAN', 'WILLIAMS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (138, 'LUCILLE', 'DEE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (139, 'EWAN', 'GOODING', datetime.datetime(2006, 2, 15, 4, 34, 33)), (140, 'WHOOPI', 'HURT', datetime.datetime(2006, 2, 15, 4, 34, 33)), (141, 'CATE', 'HARRIS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (142, 'JADA', 'RYDER', datetime.datetime(2006, 2, 15, 4, 34, 33)), (143, 'RIVER', 'DEAN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (144, 'ANGELA', 'WITHERSPOON', datetime.datetime(2006, 2, 15, 4, 34, 33)), (145, 'KIM', 'ALLEN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (146, 'ALBERT', 'JOHANSSON', datetime.datetime(2006, 2, 15, 4, 34, 33)), (147, 'FAY', 'WINSLET', datetime.datetime(2006, 2, 15, 4, 34, 33)), (148, 'EMILY', 'DEE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (149, 'RUSSELL', 'TEMPLE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (150, 'JAYNE', 'NOLTE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (151, 'GEOFFREY', 'HESTON', datetime.datetime(2006, 2, 15, 4, 34, 33)), (152, 'BEN', 'HARRIS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (153, 'MINNIE', 'KILMER', datetime.datetime(2006, 2, 15, 4, 34, 33)), (154, 'MERYL', 'GIBSON', datetime.datetime(2006, 2, 15, 4, 34, 33)), (155, 'IAN', 'TANDY', datetime.datetime(2006, 2, 15, 4, 34, 33)), (156, 'FAY', 'WOOD', datetime.datetime(2006, 2, 15, 4, 34, 33)), (157, 'GRETA', 'MALDEN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (158, 'VIVIEN', 'BASINGER', datetime.datetime(2006, 2, 15, 4, 34, 33)), (159, 'LAURA', 'BRODY', datetime.datetime(2006, 2, 15, 4, 34, 33)), (160, 'CHRIS', 'DEPP', datetime.datetime(2006, 2, 15, 4, 34, 33)), (161, 'HARVEY', 'HOPE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (162, 'OPRAH', 'KILMER', datetime.datetime(2006, 2, 15, 4, 34, 33)), (163, 'CHRISTOPHER', 'WEST', datetime.datetime(2006, 2, 15, 4, 34, 33)), (164, 'HUMPHREY', 'WILLIS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (165, 'AL', 'GARLAND', datetime.datetime(2006, 2, 15, 4, 34, 33)), (166, 'NICK', 'DEGENERES', datetime.datetime(2006, 2, 15, 4, 34, 33)), (167, 'LAURENCE', 'BULLOCK', datetime.datetime(2006, 2, 15, 4, 34, 33)), (168, 'WILL', 'WILSON', datetime.datetime(2006, 2, 15, 4, 34, 33)), (169, 'KENNETH', 'HOFFMAN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (170, 'MENA', 'HOPPER', datetime.datetime(2006, 2, 15, 4, 34, 33)), (171, 'OLYMPIA', 'PFEIFFER', datetime.datetime(2006, 2, 15, 4, 34, 33)), (172, 'GROUCHO', 'WILLIAMS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (173, 'ALAN', 'DREYFUSS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (174, 'MICHAEL', 'BENING', datetime.datetime(2006, 2, 15, 4, 34, 33)), (175, 'WILLIAM', 'HACKMAN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (176, 'JON', 'CHASE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (177, 'GENE', 'MCKELLEN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (178, 'LISA', 'MONROE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (179, 'ED', 'GUINESS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (180, 'JEFF', 'SILVERSTONE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (181, 'MATTHEW', 'CARREY', datetime.datetime(2006, 2, 15, 4, 34, 33)), (182, 'DEBBIE', 'AKROYD', datetime.datetime(2006, 2, 15, 4, 34, 33)), (183, 'RUSSELL', 'CLOSE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (184, 'HUMPHREY', 'GARLAND', datetime.datetime(2006, 2, 15, 4, 34, 33)), (185, 'MICHAEL', 'BOLGER', datetime.datetime(2006, 2, 15, 4, 34, 33)), (186, 'JULIA', 'ZELLWEGER', datetime.datetime(2006, 2, 15, 4, 34, 33)), (187, 'RENEE', 'BALL', datetime.datetime(2006, 2, 15, 4, 34, 33)), (188, 'ROCK', 'DUKAKIS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (189, 'CUBA', 'BIRCH', datetime.datetime(2006, 2, 15, 4, 34, 33)), (190, 'AUDREY', 'BAILEY', datetime.datetime(2006, 2, 15, 4, 34, 33)), (191, 'GREGORY', 'GOODING', datetime.datetime(2006, 2, 15, 4, 34, 33)), (192, 'JOHN', 'SUVARI', datetime.datetime(2006, 2, 15, 4, 34, 33)), (193, 'BURT', 'TEMPLE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (194, 'MERYL', 'ALLEN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (195, 'JAYNE', 'SILVERSTONE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (196, 'BELA', 'WALKEN', datetime.datetime(2006, 2, 15, 4, 34, 33)), (197, 'REESE', 'WEST', datetime.datetime(2006, 2, 15, 4, 34, 33)), (198, 'MARY', 'KEITEL', datetime.datetime(2006, 2, 15, 4, 34, 33)), (199, 'JULIA', 'FAWCETT', datetime.datetime(2006, 2, 15, 4, 34, 33)), (200, 'THORA', 'TEMPLE', datetime.datetime(2006, 2, 15, 4, 34, 33))]

In [183]:
import pandas as pd

In [184]:
#import sqlite3


#conn = sqlite3.connect('test_database') 
          
sql_query = pd.read_sql_query ('''
                               SELECT
                               *
                               FROM actor
                               ''', mydb)

df = pd.DataFrame(sql_query, columns = ['actor_id', 'first_name', 'last_name', 'last_update'])

     actor_id first_name     last_name         last_update
0           1   PENELOPE       GUINESS 2006-02-15 04:34:33
1           2       NICK      WAHLBERG 2006-02-15 04:34:33
2           3         ED         CHASE 2006-02-15 04:34:33
3           4   JENNIFER         DAVIS 2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
..        ...        ...           ...                 ...
195       196       BELA        WALKEN 2006-02-15 04:34:33
196       197      REESE          WEST 2006-02-15 04:34:33
197       198       MARY        KEITEL 2006-02-15 04:34:33
198       199      JULIA       FAWCETT 2006-02-15 04:34:33
199       200      THORA        TEMPLE 2006-02-15 04:34:33

[200 rows x 4 columns]

/var/folders/fx/4bnhkgc97836ksjrn6b864200000gn/T/ipykernel_1209/4177169434.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  sql_query = pd.read_sql_query ('''

In [185]:
df

     actor_id first_name     last_name         last_update
0           1   PENELOPE       GUINESS 2006-02-15 04:34:33
1           2       NICK      WAHLBERG 2006-02-15 04:34:33
2           3         ED         CHASE 2006-02-15 04:34:33
3           4   JENNIFER         DAVIS 2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
..        ...        ...           ...                 ...
195       196       BELA        WALKEN 2006-02-15 04:34:33
196       197      REESE          WEST 2006-02-15 04:34:33
197       198       MARY        KEITEL 2006-02-15 04:34:33
198       199      JULIA       FAWCETT 2006-02-15 04:34:33
199       200      THORA        TEMPLE 2006-02-15 04:34:33

[200 rows x 4 columns]

In [212]:
mycursor.execute("INSERT INTO actor (first_name, last_name) VALUES ('John Doe', 'nn')")
mydb.commit()
print(mycursor.rowcount, "record(s) updated.")
sql_query = pd.read_sql_query ('''
                               SELECT
                               *
                               FROM actor
                               ''', mydb)

df = pd.DataFrame(sql_query, columns = ['actor_id', 'first_name', 'last_name', 'last_update'])
df

1 record(s) updated.

/var/folders/fx/4bnhkgc97836ksjrn6b864200000gn/T/ipykernel_1209/530053125.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  sql_query = pd.read_sql_query ('''

     actor_id first_name     last_name         last_update
0           1   PENELOPE       GUINESS 2006-02-15 04:34:33
1           2       NICK      WAHLBERG 2006-02-15 04:34:33
2           3         ED         CHASE 2006-02-15 04:34:33
3           4   JENNIFER         DAVIS 2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
..        ...        ...           ...                 ...
199       200      THORA        TEMPLE 2006-02-15 04:34:33
200       201   John Doe            nn 2024-02-02 13:52:45
201       202   John Doe            nn 2024-02-02 14:05:30
202       203   John Doe            nn 2024-02-02 14:05:37
203       204   John Doe            nn 2024-02-02 14:06:01

[204 rows x 4 columns]

In [213]:
sql = "UPDATE actor SET first_name=%s, last_name=%s WHERE actor_id=%s"
val = ("Anne", "Gal", 22)
mycursor.execute(sql, val)

mydb.commit()

sql_query = pd.read_sql_query ('''
                               SELECT
                               *
                               FROM actor
                               ''', mydb)

df = pd.DataFrame(sql_query, columns = ['actor_id', 'first_name', 'last_name', 'last_update'])
df.head(25)

0 record(s) updated.

/var/folders/fx/4bnhkgc97836ksjrn6b864200000gn/T/ipykernel_1209/1729504528.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  sql_query = pd.read_sql_query ('''

    actor_id first_name     last_name         last_update
0          1   PENELOPE       GUINESS 2006-02-15 04:34:33
1          2       NICK      WAHLBERG 2006-02-15 04:34:33
2          3         ED         CHASE 2006-02-15 04:34:33
3          4   JENNIFER         DAVIS 2006-02-15 04:34:33
4          5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
5          6      BETTE     NICHOLSON 2006-02-15 04:34:33
6          7      GRACE        MOSTEL 2006-02-15 04:34:33
7          8    MATTHEW     JOHANSSON 2006-02-15 04:34:33
8          9        JOE         SWANK 2006-02-15 04:34:33
9         10  CHRISTIAN         GABLE 2006-02-15 04:34:33
10        11       ZERO          CAGE 2006-02-15 04:34:33
11        12       KARL         BERRY 2006-02-15 04:34:33
12        13        UMA          WOOD 2006-02-15 04:34:33
13        14     VIVIEN        BERGEN 2006-02-15 04:34:33
14        15       CUBA       OLIVIER 2006-02-15 04:34:33
15        16       FRED       COSTNER 2006-02-15 04:34:33
16        17      HELEN        VOIGHT 2006-02-15 04:34:33
17        18        DAN          TORN 2006-02-15 04:34:33
18        19        BOB       FAWCETT 2006-02-15 04:34:33
19        20    LUCILLE         TRACY 2006-02-15 04:34:33
20        21    KIRSTEN       PALTROW 2006-02-15 04:34:33
21        22       Anne           Gal 2024-02-02 14:01:26
22        23     SANDRA        KILMER 2006-02-15 04:34:33
23        24    CAMERON        STREEP 2006-02-15 04:34:33
24        25      KEVIN         BLOOM 2006-02-15 04:34:33

In [221]:
sql = "DELETE FROM actor WHERE last_name=%s;"
val = ["nn"]
mycursor.execute(sql, val)
mydb.commit()
print(mycursor.rowcount, "record(s) updated.")

sql_query = pd.read_sql_query ('''
                               SELECT
                               *
                               FROM actor
                               ''', mydb)

df = pd.DataFrame(sql_query, columns = ['actor_id', 'first_name', 'last_name', 'last_update'])
df

0 record(s) updated.

/var/folders/fx/4bnhkgc97836ksjrn6b864200000gn/T/ipykernel_1209/1973368986.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  sql_query = pd.read_sql_query ('''

     actor_id first_name     last_name         last_update
0           1   PENELOPE       GUINESS 2006-02-15 04:34:33
1           2       NICK      WAHLBERG 2006-02-15 04:34:33
2           3         ED         CHASE 2006-02-15 04:34:33
3           4   JENNIFER         DAVIS 2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
..        ...        ...           ...                 ...
195       196       BELA        WALKEN 2006-02-15 04:34:33
196       197      REESE          WEST 2006-02-15 04:34:33
197       198       MARY        KEITEL 2006-02-15 04:34:33
198       199      JULIA       FAWCETT 2006-02-15 04:34:33
199       200      THORA        TEMPLE 2006-02-15 04:34:33

[200 rows x 4 columns]

In [229]:
# cek data type
df.dtypes

actor_id                int64
first_name             object
last_name              object
last_update    datetime64[ns]
dtype: object

In [227]:
df.isnull().sum()

actor_id       0
first_name     0
last_name      0
last_update    0
dtype: int64

In [230]:
df.describe()

         actor_id
count  200.000000
mean   100.500000
std     57.879185
min      1.000000
25%     50.750000
50%    100.500000
75%    150.250000
max    200.000000

In [232]:
type(df["last_name"][1])

str

jika ada "BE" di belakang, tampilkan nama depan

In [237]:
for x in range(len(df)):
    if 'BE' in df['last_name'][x]:
        print(df['first_name'][x])

NICK
KARL
VIVIEN
PARKER
HENRY
CHRISTOPHER
DARYL
LIZA
SCARLETT
MICHAEL

In [254]:
#mycursor = mydb.cursor()
#crsr = cnxn.cursor()
sql_query = pd.read_sql_query ('''
                               SELECT
                               address_id, address, address.city_id, city 
                               FROM address
                               INNER JOIN city
                               ON address.city_id = city.city_id;
                               ''', mydb)

city = pd.DataFrame(sql_query, columns = ["address_id", "address", "city_id", "city"])
city

/var/folders/fx/4bnhkgc97836ksjrn6b864200000gn/T/ipykernel_1209/1775013325.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  sql_query = pd.read_sql_query ('''

     address_id                   address  city_id        city
0             1         47 MySakila Drive      300  Lethbridge
1             2        28 MySQL Boulevard      576   Woodridge
2             3         23 Workhaven Lane      300  Lethbridge
3             4      1411 Lillydale Drive      576   Woodridge
4             5            1913 Hanoi Way      463      Sasebo
..          ...                       ...      ...         ...
598         601       844 Bucuresti Place      242     Jinzhou
599         602  1101 Bucuresti Boulevard      401      Patras
600         603    1103 Quilmes Boulevard      503     Sullana
601         604       1331 Usak Boulevard      296    Lausanne
602         605      1325 Fukuyama Street      537       Tieli

[603 rows x 4 columns]

In [258]:
N = 1
while N < 60:
    print("kota", city['city'][N], "dan alamat", city['address'][N])
    N+=1

kota Woodridge dan alamat 28 MySQL Boulevard
kota Lethbridge dan alamat 23 Workhaven Lane
kota Woodridge dan alamat 1411 Lillydale Drive
kota Sasebo dan alamat 1913 Hanoi Way
kota San Bernardino dan alamat 1121 Loja Avenue
kota Athenai dan alamat 692 Joliet Street
kota Myingyan dan alamat 1566 Inegöl Manor
kota Nantou dan alamat 53 Idfu Parkway
kota Laredo dan alamat 1795 Santiago de Compostela Way
kota Kragujevac dan alamat 900 Santiago de Compostela Parkway
kota Hamilton dan alamat 478 Joliet Way
kota Masqat dan alamat 613 Korolev Drive
kota Esfahan dan alamat 1531 Salé Drive
kota Sagamihara dan alamat 1542 Tarlac Parkway
kota Yamuna Nagar dan alamat 808 Bhopal Manor
kota Osmaniye dan alamat 270 Amroha Parkway
kota Citrus Heights dan alamat 770 Bydgoszcz Avenue
kota Bhopal dan alamat 419 Iligan Lane
kota Southend-on-Sea dan alamat 360 Toulouse Parkway
kota Elista dan alamat 270 Toulon Boulevard
kota Kaduna dan alamat 320 Brest Avenue
kota Kimberley dan alamat 1417 Lancaster Avenue
kota Mardan dan alamat 1688 Okara Way
kota Tangail dan alamat 262 A Coruña (La Coruña) Parkway
kota Salé dan alamat 28 Charlotte Amalie Street
kota Liepaja dan alamat 1780 Hino Boulevard
kota Córdoba dan alamat 96 Tafuna Way
kota Shikarpur dan alamat 934 San Felipe de Puerto Plata Street
kota Città del Vaticano dan alamat 18 Duisburg Boulevard
kota Davao dan alamat 217 Botshabelo Place
kota Munger (Monghyr) dan alamat 1425 Shikarpur Manor
kota Shimonoseki dan alamat 786 Aurora Avenue
kota Lungtan dan alamat 1668 Anápolis Street
kota Kamarhati dan alamat 33 Gorontalo Way
kota Jhansi dan alamat 176 Mandaluyong Place
kota Alessandria dan alamat 127 Purnea (Purnia) Manor
kota Kurashiki dan alamat 61 Tama Street
kota Toulouse dan alamat 391 Callao Drive
kota Arak dan alamat 334 Munger (Monghyr) Lane
kota Nanyang dan alamat 1440 Fukuyama Loop
kota Chisinau dan alamat 269 Cam Ranh Parkway
kota Vila Velha dan alamat 306 Antofagasta Place
kota Nador dan alamat 671 Graz Street
kota Yerevan dan alamat 42 Brindisi Place
kota Pak Kret dan alamat 1632 Bislig Avenue
kota Faaa dan alamat 1447 Imus Way
kota Lipetsk dan alamat 1998 Halifax Drive
kota Antofagasta dan alamat 1718 Valencia Street
kota Moscow dan alamat 46 Pjatigorsk Lane
kota Juazeiro do Norte dan alamat 686 Garland Manor
kota Niznekamsk dan alamat 909 Garland Manor
kota Jedda dan alamat 725 Isesaki Place
kota Omdurman dan alamat 115 Hidalgo Parkway
kota Fontana dan alamat 1135 Izumisano Parkway
kota A Coruña (La Coruña) dan alamat 939 Probolinggo Loop
kota Nagareyama dan alamat 17 Kabul Boulevard
kota Iwakuni dan alamat 1964 Allappuzha (Alleppey) Street
kota Balašiha dan alamat 1697 Kowloon and New Kowloon Loop
kota Papeete dan alamat 1668 Saint Louis Place